# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2 64*320*320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 128*160*160
   [-1, 3, C3, [128]], #128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 256*80*80
   [-1, 9, C3, [256]], #256*80*80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16 512*40*40
   [-1, 9, C3, [512]], #512*40*40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 1024*20*20
   [-1, 1, SPP, [1024, [5, 9, 13]]], #1024*20*20
   [-1, 1, MobileViTBlock, [240, 3, 1024]],  # 9 1024*20*20
  ]

# YOLOv5 head
head:
  [ [ -1, 1, Conv, [ 512, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # cat backbone P4
    [ -1, 3, C3, [ 512, False ] ],  # 13

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 3, C3, [ 256, False ] ],  # 17 (P3/8-small)

    [ -1, 1, Conv, [ 256, 3, 2 ] ], #18
    [ [ -1, 14 ], 1, Concat, [ 1 ] ],  # cat head P4
    [ -1, 3, C3, [ 512, False ] ],  # 20 (P4/16-medium)

    [ -1, 1, Conv, [ 512, 3, 2 ] ],
    [ [ -1, 10 ], 1, Concat, [ 1 ] ],  # cat head P5
    [ -1, 3, C3, [ 1024, False ] ],  # 23 (P5/32-large)

    [ [ 17, 20, 23 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
  ]
#  [[-1, 1, Conv, [512, 1, 1]], #512*20*20
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #512*40*40
#   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 #1024*40*40
#   [-1, 3, C3, [512]],  # 13 512*40*40
#   [-1, 1, CBAM, [512]], # 14 512*40*40
#
#   [-1, 1, Conv, [256, 1, 1]], #256*40*40
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #256*80*80
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 512*80*80
#   [-1, 3, C3, [256]],  # 18 (P3/8-small) 256*80*80
#    [-1, 1, CBAM, [256]], #19
#
#    [ -1, 1, Conv, [ 256, 1, 1 ] ], #20  256*80*80
#    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], #21  256*160*160
#    [ [ -1, 2 ], 1, Concat, [ 1 ] ], #22 cat backbone p2  384*160*160
#    [-1, 1, C3TR, [256]],
#    [ -1, 1, CBAM, [ 256] ], #24 256*160*160
#
#   [-1, 1, Conv, [256, 3, 2]], #25 256*80*80
#   [[-1, 20], 1, Concat, [1]],  #26 cat head P4 512*80*80
#   [-1, 1, C3TR, [256]],
#   [-1, 1, CBAM, [256]],  # 28 (P4/16-medium) 256*80*80
#
#   [ -1, 1, Conv, [ 256, 3, 2 ] ], #29 256*40*40
#   [ [ -1, 15 ], 1, Concat, [ 1 ] ],  #30 cat head P4 512*40*40
#   [-1, 2, C3TR, [512]],
#   [ -1, 3, C3, [ 512, False ] ],  # 32 (P4/16-medium) 512*40*40
#
#   [-1, 1, Conv, [512, 3, 2]], #33 512*20*20
#   [[-1, 10], 1, Concat, [1]],  #34 cat head P5
#   [-1, 3, C3TR, [1024, False]],  # 35 (P5/32-large)
#
#   [[23, 31, 35], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]
